Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: - After 3 authentication failures on the user API, the end-user have to unlock his account by using the login form
ja: - ユーザーAPIでの認証が3回失敗したら、エンドユーザーはログインフォームを使用させアカウントのロックを解除しなければならない

source: Internal Task Links -------------------
ja: 内部リンク -------------------

source: // This filter is used to find the groups of our user define('LDAP_GROUP_USER_FILTER', '(&(objectClass=posixGroup)(memberUid=%s))');
ja: // このフィルターはユーザーがグループを探すのに使用されます define('LDAP_GROUP_USER_FILTER', '(&(objectClass=posixGroup)(memberUid=%s))');

source: - Web (see below)
ja: - Web (下記)

source: To minimize user interaction, Kanboard support automated actions.
ja: ユーザーの操作を最少化するため、Kanboardは自動アクションをサポートしています。

source: note:: Using a shared hosting provider is not recommended.
ja: 注意:: 共有ホスティングサービスの利用は推奨しません。

source: If you don’t want to install a web server like Apache on localhost.
ja: localhost上にApacheのようなwebサーバーをインストールしたくないなら、

source: - Automatically assign a category based on a color
ja: - 色に基いてカテゴリを変える

source: Avatar Providers ================
ja: アバターのプロバイダ ================

source: Go to the task view page or use the drop-down menu on the board, then select **Edit recurrence**.
ja: タスクビューのページに移動するか、ボード上のドロップダウンメニューを使用して、**反復タスクの編集** を選択してください。

source: // The end-user will be able to browse LDAP groups from the user interface and allow access to specified projects
ja: // エンドユーザーはユーザーインターフェースからLDAPグループをブラウズできるようになり、特定のプロジェクトへのアクセスを許可します。

source: Burn Down Chart ---------------
ja: バーンダウンチャート ---------------

source: By default, Kanboard use Sqlite to store its data but it’s also possible to use Postgresql.
ja: デフォルトではKanboardは Sqlite にデータを保存しますが、Postgresqlの使用も可能です。

source: Do that first
ja: 最初にやること

source: - Find tasks for several projects:
ja: - プロジェクトIDで検索: ``project:23``

source: # Title level 1
ja: # 見出し level 1

source: If you encounter an error, report the issue to the bug tracker with the exact SQL error 5.
ja: もしエラーが発生した場合、正確なSQLエラーを添えてissueをバグトラッカーに報告してください。 5.

source: Tables ------
ja: 表 ------

source: - ``getExternalId()``: Get external unique id
ja: - ``getExternalId()``: ユニークな外部IDを取得する

source: Some hooks can have only one listener: ``model:subtask-time-tracking:calculate:time-spent``
ja: いくつかのフックは一つだけのリスナーを持つことができます: ``model:subtask-time-tracking:calculate:time-spent``

source: See `<http://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_.
ja: `<http://nginx.org/en/docs/http/ngx_http_core_module.html#client_max_body_size>`_ を参照願います。

source: _result-5:
ja: _結果-5:

source: Go to http://localhost/phpinfo.php and should see all information about your PHP installation.
ja: http://localhost/phpinfo.php を開いたら、PHPのインストールについての情報が表示されるはずです。

source: Note: Only tasks within the date range of -2 months to +6 months are exported to the iCalendar feed.
ja: 注意:iCalenderで配信されるタスクは、2ヵ月前から6ヵ月先の範囲だけです。

source: - You must restart the container to take into account the new parameters of your custom config file.
ja: - カスタム設定ファイルの新しいパラメーターを利用するために、コンテナを再起動しなければなりません。

source: More over, after a successful authentication, a Two-Factor post authentication can be done.
ja: 更に、認証に成功した後も、2要素認証をすることができます。

source: Activity Stream Search ----------------------
ja: 活動状況を検索 ----------------------

source: // Available log drivers: syslog, stderr, stdout or file
ja: // 利用可能なログドライバ: syslog, stderr, stdout or file

source: - Username and password authentication (Local database and LDAP)
ja: - ユーザー名とパスワード (ローカルなデータベースとLDAP)

source: - Write maintainable code, avoid code duplication, use good practices.
ja: - メンテナンスしやすいコードを書き、コードの重複を避け、慣習に従ってください。

source: - Use the background workers if you still want to use SMTP
ja: - SMTPを使い続けたい場合、バックグラウンドワーカーを利用する

source: figure:: /_static/board-collapsed-mode.png :alt: Tasks collapsed
ja: figure:: /_static/board-collapsed-mode.png :alt: タスクの簡略表示

source: figure:: /_static/tags-board.png :alt: Tags on the board
ja: figure:: /_static/tags-board.png :alt: ボード上のタグの表示

source: People who are using a remote database (Mysql/Postgresql) and object storage (AWS S3 or similar) don’t necessarily need to have a persistent local data folder or to change the permissions for the folder.
ja: リモートのデータベース (Mysql/Postgresql) を使用し、かつ(AWS S3 の類の)オブジェクトストレージを使用している場合、必ずしもローカルの恒久的なデータフォルダや、フォルダのアクセス権の変更は必要ありません。

source: - Note 2: This feature is only compatible with LDAP authentication configured in “proxy” or “anonymous” mode
ja: - 注意2: この機能はLDAP認証が "proxy" モードか "anonymous" モードに設定されている場合のみ互換性があります。

source: - Purpose: **Create a new category**
ja: - 用途: **カテゴリの新規作成**

source: - You should start the Kanboard worker with a process supervisor (systemd, upstart or supervisord)
ja: - Kanboardのワーカーの開始はプロセススーパーバイザー (systemd, upstart or supervisord) を使用すべきです。

source: - Executor (users that moves the task)
ja: - 実行者(タスクを移動したユーザー)

source: - You can collapse swimlanes by clicking on the icon on the left
ja: - 左のアイコンをクリックすることでスイムレーンを折りたたむことが出来ます。

source: For the first time, Kanboard will run one by one each database migration and this process can take some time according to your configuration.
ja: Kanboardの初回実行時には、個々のデータベースのマイグレーションを一つづつ実行しますが、通常そのプロセスは設定に従います。

source: Kanboard doesn’t block any IP addresses since bots can use several anonymous proxies.
ja: Botは複数の匿名プロキシを使用できるので、KanboardはいかなるIPアドレスもブロックしません。

source: You may want to install a plugin to store your files in a cloud storage provider like `Amazon S3 <https://github.com/kanboard/plugin-s3>`__.
ja: 望むならば `Amazon S3 <https://github.com/kanboard/plugin-s3>`__ のようなクラウドストレージにインストールしたプラグインのファイルを保存できます。

source: - Change the assignee based on an external username
ja: - 担当者を外部サービスに基いて変更

source: Adding your Kanboard Calendar to Apple Calendar -----------------------------------------------
ja: KanboardのカレンダーをApple Calenderに追加する -----------------------------------------------

source: - Do not use Sqlite when you have a lot of concurrency (several users), choose Postgres or Mysql instead
ja: - 多数のユーザーで同時にSQliteを使用せず、PostgresかMysqlを使用するよう切り替える

source: To install, update and remove plugins from the user interface, you must have those requirements:
ja: ユーザーインターフェースからプラグインをインストール・アップデート及び削除するには、以下の要件を満たさなければなりません:

source: Command line ~~~~~~~~~~~~
ja: コマンドライン ~~~~~~~~~~~~

source: If you are not able to login and always get the error **“Username or password required”** even if you have entered the right credentials, that means there is a problem with the session.
ja: 正し認証情報を入力していても毎回 **"Username or password required"** エラーが発生してログインできない場合、セッションに問題が起きています。

source: _result-3:
ja: _結果-3:

source: Most of the time, upgrading Kanboard to a newer version is seamless.
ja: 殆どの場合、Kanboardを新しいバージョンへのアップグレードはシームレスです。

source: Swimlanes =========
ja: スイムレーン =========

source: However it’s possible to use MySQL or MariaDB instead of Sqlite.
ja: しかし、Sqliteの代わりにMySQLかMariaDBを使うこともできます。

source: - TaskMetadata: ``$this->taskMetadataModel``
ja: - タスクのメタデータ: ``$this->taskMetadataModel``

source: This chart show the average lead and cycle time for the last 1000 tasks over time.
ja: このチャートは、最後の1000個のタスクの平均リードタイム・平均サイクルタイムを表します。

source: - Mixing multiple software into the same database is a bad practice (shared hosting providers are not recommended).
ja: - 複数のソフトウェアで同じデータベースを使用するのは悪い習慣です (共有ホスティングサービスは推奨しません。)

source: - If you develop a mobile application, it's your responsability to store securely the user credentials on the device
ja: - モバイルアプリケーションを開発する場合、責任をもってデバイス上にユーザーの資格情報を安全に保存する

source: +--------------------------+-----------------------------------------------------------------------------+ | Variable | Description | +==========================+=============================================================================+ | DATABASE\_URL | ``[database type]://[username]:[password]@[host]:[port]/[database name]``, | | | example: ``postgres://foo:foo@myserver:5432/kanboard`` | +--------------------------+-----------------------------------------------------------------------------+ | DEBUG | Enable/Disable debug mode: ``true`` or ``false`` | +--------------------------+-----------------------------------------------------------------------------+ | API_AUTHENTICATION_TOKEN | Custom API token | +--------------------------+-----------------------------------------------------------------------------+
ja: +--------------------------+-----------------------------------------------------------------------------+ | 変数 | 概要 | +==========================+=============================================================================+ | DATABASE\_URL | ``[database type]://[username]:[password]@[host]:[port]/[database name]``, | | | example: ``postgres://foo:foo@myserver:5432/kanboard`` | +--------------------------+-----------------------------------------------------------------------------+ | DEBUG | デバッグモードの有効化/無効化: ``true`` or ``false`` | +--------------------------+-----------------------------------------------------------------------------+ | API_AUTHENTICATION_TOKEN | カスタムAPIトークン | +--------------------------+-----------------------------------------------------------------------------+

source: Plugin can be translated in the same way as the rest of the application.
ja: プラグインはアプリケーションと同じ方法で翻訳できます。

source: plugin
ja: プラグイン

source: - ``getRole()``: Get user role
ja: - ``getRole()``: ユーザーの役割を取得する

source: _result-4:
ja: _結果-4:

source: Running integration tests ~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 結合テストを実行する ~~~~~~~~~~~~~~~~~~~~~~~~~

source: Send notifications for overdue tasks ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: 期限切れのタスクの通知を送る ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: // Mysql/Postgres hostname define('DB_HOSTNAME', 'localhost');
ja: // Mysql/Postgres のホスト名 define('DB_HOSTNAME', 'localhost');

source: Methods for User Provider Interface:
ja: ユーザー情報提供インターフェースのメソッド:

source: - Enable the debug mode
ja: - デバッグモードを有効にする

source: You **must define the parameter** ``LDAP_GROUP_USER_FILTER`` if your LDAP server use ``memberUid`` instead of ``memberOf``.
ja: LDAPサーバーが ``memberOf`` の代わりに ``memberUid`` を使用する場合、 ``LDAP_GROUP_USER_FILTER`` を **定義しなければなりません** 。

source: // LDAP user group filter
ja: // LDAP ユーザーグループフィルター

source: - If there is no start date the task will not appear on the calendar.
ja: - 開始日が無いタスクはカレンダー上に表示されません。

source: _result-1:
ja: _結果-1:

source: That means there are too many tasks in progress at the same time.
ja: これは、同時進行するにはタスクが多すぎることを意味します。

source: - People are not going to spend days and weeks of their time to develop a feature just for you.
ja: - 貢献してくれている人々はあなたの要望する特徴の為だけに時間を費やせません。

source: This library can perform common operations.
ja: このライブラリは共通の動き方をすることができます。

source: By default Kanboard use Sqlite to stores its data.
ja: デフォルトではKanboardは Sqlite にデータを保存します。

source: js Minify Javascript files
ja: js 最小限のJavascriptファイル

source: Average Lead and Cycle time ---------------------------
ja: 平均リードタイム・平均サイクルタイム ---------------------------

source: To remove a project, you must be the manager of the project or an administrator.
ja: プロジェクトを削除するには、プロジェクト管理者かシステム管理者でなければなりません。

source: Todo lists: ~~~~~~~~~~~
ja: Todo リスト: ~~~~~~~~~~~

source: - Example of URL rewritten: ``/board/123``
ja: - URL rewriteで書き換えられたURLの例: ``/board/123``

source: db:version Show database schema version
ja: db:version データベースのスキーマのバージョンを表示

source: _result-2:
ja: _結果-2:

source: Create a new translation:
ja: 新しく翻訳ファイルを作成する:

source: Subtask Time Tracking API procedures ====================================
ja: サブタスクの時間追跡のプロシージャ ====================================

source: The image can be stored in JPEG or PNG format.
ja: 保存可能な画像はJPEGとPNGフォーマットです。

source: - Purpose: **Get file information**
ja: - 用途: **ファイルの情報を取得する**

source: - Purpose: **removeTag**
ja: - 用途: **タグを削除する**

source: For example your plugin can store external information for a task or new settings for a project.
ja: 例えばあなたのプラグインはタスクやプロジェクトの新しい設定を外部情報として保存できます。

source: - We use `Sphinx <http://www.sphinx-doc.org/>`_ and the `reStructuredText <https://en.wikipedia.org/wiki/ReStructuredText>`_ markup language to generate this documentation in multiple formats.
ja: - 我々は`Sphinx <http://www.sphinx-doc.org/>`_ と、`reStructuredText <https://en.wikipedia.org/wiki/ReStructuredText>`_ マークアップ言語でこの文書を複数の形式で生成しています。

source: To work properly, Kanboard requires that a background job run on a daily basis.
ja: 正しく働くには、Kanboardは毎日の基本的なバックグラウンドジョブの実行を必要とします。

source: Start using the software 7.
ja: ソフトウェアの使用を開始してください。 7.

source: - Click on **File > New Calendar**
ja: - **File > New Calendar** をクリックする

source: Default settings can be changed with these configuration variables:
ja: デフォルトの設定はこれらの設定変数で変更できます:

source: The outer pipes (|) are optional, and you don't need to make the raw Markdown line up prettily.
ja: 外側のパイプ (|) は任意で、そして生のMarkdownでは美しく整列させる必要はありません。

source: - Public board view
ja: - 公開ボードビュー

source: Subtasks ========
ja: サブタスク ========

source: Two spaces after the last world will render the text on a new line:
ja: 行末に2連続のスペースをつけると、そこで強制的に改行します:

source: - ``dashboard/sidebar`` is the template name
ja: - ``dashboard/sidebar`` はテンプレート名です

source: - Do not forget to change the default user/password.
ja: - デフォルトのユーザー名/パスワードの変更を忘れないようにしてください。

source: note:: Always prefix the metadata name with your plugin name
ja: 注意:: メタデータ名のプレフィックスは常にプラグイン名になります。

source: +----------------------------------+-----------+----------------------------------+ | Parameter | Default | Description | | | value | | +==================================+===========+==================================+ | ``LDAP_AUTH`` | false | Enable LDAP authentication | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SERVER`` | Empty | LDAP server hostname | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PORT`` | 389 | LDAP server port | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SSL_VERIFY`` | true | Validate certificate for | | | | ``ldaps://`` style URL | +----------------------------------+-----------+----------------------------------+ | ``LDAP_START_TLS`` | false | Enable LDAP start TLS | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME_CASE_SENSITIVE`` | false | Kanboard lowercase the ldap | | | | username to avoid duplicate | | | | users (the database is case | | | | sensitive) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_BIND_TYPE`` | anonymous | Bind type: “anonymous”, “user” | | | | or “proxy” | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME`` | null | LDAP username to use with proxy | | | | mode or username pattern to use | | | | with user mode | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PASSWORD`` | null | LDAP password to use for proxy | | | | mode | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_BASE_DN`` | Empty | LDAP DN for users (Example: | | | | “CN=Users,DC=kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_FILTER`` | Empty | LDAP pattern to use when | | | | searching for a user account | | | | (Example: | | | | “(&(objectClass=user)(sAMAccount | | | | Name=%s))”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_USERNAME`` | uid | LDAP attribute for username | | | | (Example: “samaccountname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_FULLNAME`` | cn | LDAP attribute for user full | | | | name (Example: “displayname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_EMAIL`` | mail | LDAP attribute for user email | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_GROUPS`` | memberof | LDAP attribute to find groups in | | | | user profile | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_PHOTO`` | Empty | LDAP attribute to find user | | | | photo (jpegPhoto or | | | | thumbnailPhoto | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_LANGUAGE`` | Empty | LDAP attribute for user language | | | | (preferredlanguage), the | | | | accepted language format is | | | | “fr-FR” | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_CREATION`` | true | Enable automatic LDAP user | | | | creation | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_ADMIN_DN`` | Empty | LDAP DN for administrators | | | | (Example: | | | | “CN=Kanboard-Admins,CN=Users,DC= | | | | kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_MANAGER_DN`` | Empty | LDAP DN for managers (Example: | | | | “CN=Kanboard | | | | Managers,CN=Users,DC=kanboard,DC | | | | =local”) | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_PROVIDER`` | false | Enable LDAP group provider for | | | | project permissions | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_BASE_DN`` | Empty | LDAP Base DN for groups | | | | | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_FILTER`` | Empty | LDAP group filter (Example: | | | | “(&(objectClass=group)(sAMAccoun | | | | tName=%s*))“) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_USER_FILTER`` | Empty | If defined, Kanboard will search | | | | user groups in | | | | LDAP_GROUP_BASE_DN with this | | | | filter, it’s useful only for | | | | posixGroups (Example: | | | | ``(&(objectClass=posixGroup)(mem | | | | berUid=%s))``) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_ATTRIBUTE_NAME`` | cn | LDAP attribute for the group | | | | name | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_USER_ATTRIBUTE`` | username | LDAP attribute for the user in | | | | the group filter | +----------------------------------+-----------+----------------------------------+
ja: +----------------------------------+-----------+----------------------------------+ | パラメータ | デフォルト値 | 概要 | +==================================+===========+==================================+ | ``LDAP_AUTH`` | false | LDAP 認証を有効にする | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SERVER`` | Empty | LDAP サーバーのホスト名 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PORT`` | 389 | LDAP サーバーのポート番号 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SSL_VERIFY`` | true | ``ldaps://`` スタイルのURLで | | | | 証明書を検証する | +----------------------------------+-----------+----------------------------------+ | ``LDAP_START_TLS`` | false | LDAP をTLS接続で開始する | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME_CASE_SENSITIVE`` | false | Kanboard は | | | | ユーザーの重複防止のためLDAPユーザー名 で | | | | 小文字を使用する (データベースは | | | | 大文字小文字を区別する) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_BIND_TYPE`` | anonymous | バインドタイプ: “anonymous”, “user” | | | | or “proxy” | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME`` | null |プロキシモードで使用するLDAPユーザー名か、 | | | | ユーザーモードで使用するユーザー名のパターン | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PASSWORD`` | null | プロキシモードで使用する | | | | LDAP パスワード | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_BASE_DN`` | Empty | ユーザーの LDAP 識別名 (例: | | | | “CN=Users,DC=kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_FILTER`` | Empty | LDAPでユーザーアカウント検索に | | | | 使用するパターン | | | | (例: | | | | “(&(objectClass=user)(sAMAccount | | | | Name=%s))”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_USERNAME`` | uid | ユーザー名のLDAP属性 | | | | (例: “samaccountname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_FULLNAME`` | cn | ユーザーのフルネームのLDAP属性 | | | | (例: “displayname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_EMAIL`` | mail | ユーザーのEmailアドレスのLDAP属性 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_GROUPS`` | memberof | ユーザープロフィールから | | | | グループを見つけるためのLDAP属性 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_PHOTO`` | Empty | ユーザーの画像を見つけるための | | | | LDAP属性 (jpegPhoto or | | | | thumbnailPhoto | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_LANGUAGE`` | Empty | ユーザーの言語のLDAP属性 | | | | (preferredlanguage)で、 | | | | 利用できる言語のフォーマットは | | | | “fr-FR”のようになります。 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_CREATION`` | true | 自動的にLDAPユーザーを作成する | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_ADMIN_DN`` | Empty | システム管理者のLDAP識別名 | | | | (例: | | | | “CN=Kanboard-Admins,CN=Users,DC= | | | | kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_MANAGER_DN`` | Empty | プロジェクト管理者のLDAP識別名 | | | | (例: “CN=Kanboard Managers, | | | | CN=Users,DC=kanboard,DC | | | | =local”) | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_PROVIDER`` | false | プロジェクトの権限の設定のために | | | | LDAP グループプロバイダを有効にする | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_BASE_DN`` | Empty | グループのLDAP Base DN | | | | | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_FILTER`` | Empty | LDAP グループのフィルタ (例: | | | | “(&(objectClass=group)(sAMAccoun | | | | tName=%s*))“) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_USER_FILTER`` | Empty | これが定義されている場合、 | | | | KanboardはこのフィルターとLDAP_GROUP_BASE_DNで検索します。 | | | | これはposixGroupesに限って便利です。 | | | | (例: | | | | ``(&(objectClass=posixGroup)(mem | | | | berUid=%s))``) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_ATTRIBUTE_NAME`` | cn | グループフィルタ内でのユーザーのLDAP属性 | | | | name | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_ATTRIBUTE_NAME`` | cn | グループ名のLDAP 属性 | +----------------------------------+-----------+----------------------------------+

source: - Occasional contributors can checkout the source code and work on a patch without having to worry about all Javascript dependencies.
ja: - 時折コントリビューターはソースコードをチェックアウトして、Javascriptの依存関係の心配をせずにパッチを当てて動かします。

source: I want to report a bug ----------------------
ja: バグを報告したい ----------------------

source: Project API Procedures ======================
ja: プロジェクトのAPIプロシージャ ===========================

source: Date format ~~~~~~~~~~~
ja: 日付の書式 ~~~~~~~~~~~
